       program-id. undefined.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           display "HI".
           goback.

       end program undefined.
